#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=lambdas/demo/helloWorldHandler.zip]
module.buckets.aws_s3_bucket_object.db_sample_function_object: Refreshing state... [id=lambdas/demo/dbSampleHandler.zip]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo/rds_migrations]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/demo/minimal_lambda_function]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=demo_minimal_lambda_function]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.functions.aws_lambda_function.db_sample_lambda_function: Refreshing state... [id=demo_db_sample_lambda_function]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/1a9c4afb-0090-4fbf-8c77-0e928ad06cd2]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=9mwrfv]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-kb7gblbu69-9mwrfv-GET]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-kb7gblbu69-9mwrfv-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=qgsqcc]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-14 18:13:30 +0000 UTC]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "db_sample_function_object" {
      ~ etag               = "f947dd58012a48cab5f5329570498a4d" -> "9da8722088e267af1bd3823fc3ca75e6"
        id                 = "lambdas/demo/dbSampleHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "6052c202a777beec0b709ace694564c6" -> "d2819382b4b44863b1aec13be2e75d24"
        id                 = "lambdas/demo/helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "db_sample_lambda_function" {
        id                             = "demo_db_sample_lambda_function"
      ~ last_modified                  = "2021-10-14T18:41:17.336+0000" -> (known after apply)
      ~ source_code_hash               = "qwBav5fYL06l2/1RbDO3VTGQMQAUkgsVQwDe0FAjZTI=" -> "z2ECgqLqcqvhzn41hBiZMharFg0l0EyWgcXhZCTW28k="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "demo_minimal_lambda_function"
      ~ last_modified                  = "2021-10-14T18:41:17.354+0000" -> (known after apply)
      ~ source_code_hash               = "fbDJGdQtmR4ZuWGOSABf3ANPkbEoLcGla8zy5W2g/Hk=" -> "qRk4D3EmQ59J3j2Rn+f0xDmFc+6lyWLmJrO/278hZBg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-10-14T18:41:16Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "qgsqcc" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2021-10-14T18:41:16Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*